{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 100], "name": "context_input", "sparse": false}, "inbound_nodes": [], "name": "context_input"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 100], "name": "content_input", "sparse": false}, "inbound_nodes": [], "name": "content_input"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "context_embd", "dtype": "float32", "output_dim": 200, "trainable": true, "embeddings_regularizer": null, "input_dim": 13400, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "input_length": 100}, "inbound_nodes": [[["context_input", 0, 0, {}]]], "name": "context_embd"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "content_embd", "dtype": "float32", "output_dim": 200, "trainable": true, "embeddings_regularizer": null, "input_dim": 13400, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "input_length": 100}, "inbound_nodes": [[["content_input", 0, 0, {}]]], "name": "content_embd"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 150, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru_2", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "context_bilstm"}, "inbound_nodes": [[["context_embd", 0, 0, {}]]], "name": "context_bilstm"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 150, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru_3", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "content_bilstm"}, "inbound_nodes": [[["content_embd", 0, 0, {}]]], "name": "content_bilstm"}, {"class_name": "Attention", "config": {"trainable": true, "name": "context_att"}, "inbound_nodes": [[["context_bilstm", 0, 0, {}]]], "name": "context_att"}, {"class_name": "Attention", "config": {"trainable": true, "name": "content_att"}, "inbound_nodes": [[["content_bilstm", 0, 0, {}]]], "name": "content_att"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["context_att", 0, 0, {}], ["content_att", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "final_nn", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "final_nn"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["final_nn", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "final_output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "final_output"}], "input_layers": [["context_input", 0, 0], ["content_input", 0, 0]], "output_layers": [["final_output", 0, 0]], "name": "model_1"}, "backend": "theano"}